---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList{System.String})
source: html/ff7c884c-5301-1641-8f11-45264b536cd3.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	IList<string> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.IList < String >`)